# MultusegmentRampRiser Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultusegmentRampRiser Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Ramp can't have multisegment Riser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultusegmentRampRiser { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultusegmentRampRiser As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultusegmentRampRiser {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace